package com.projectkorea.java.step11;

public class main {
}


//
/*
* 가시성 제어 (Visibility Modifier)
클래스, 메서드, 변수 등의 접근 수준을 설정하여 외부에서 접근 가능한지 여부를 제어하는 것을 의미합니다.
OOP 에서 캡슐화를 구현하는데 사용

* 접근 지시어 (Access Modifier)
접근 지시어는 가시성 제어를 구현하기 위한 구체적인 키워드를 의미

* - 관계
접근 지시어는 가시성 제어를 실현하는 도구입니다. 즉, 가시성 제어는 더 넓은 개념이고, 접근 지시어는 이를 구현하는 방법입니다.
따라서 두 용어는 밀접하게 연관되어 있으며, 종종 비슷한 맥락에서 사용되지만, 정확히 동일한 의미는 아닙니다. 가시성 제어는 접근 수준을 제어하는 행위나 개념을 가리키고, 접근 지시어는 이를 실현하기 위한 구체적인 키워드입니다.

* 접근 가능한 곳
 public: 모든 곳
 protected: 같은 패키지, 하위 클래스
 default: 같은 패키지
 private: 선언된 클래스 내부
 */
